import React, {
  useState,
  useContext
} from "react";
import { useHistory } from "react-router-dom";
import { Form, Col, Image, roundedCircle } from "react-bootstrap";
import { auth, googleProvider, facebookProvider } from "../Frontfirebase";
import "bootstrap/dist/css/bootstrap.min.css";
// import Login from "../pages/login"
import "./rule.css";
import usercontext from "../context/usercontext";
import axios from "axios";
const Rule = () => {
  // const history = useHistory()
  // const handle = () =>{
  //     history.push("/post/create")
  // }

  let history = useHistory();
  const [state, setState] = useState(false);
  let { user, setUser } = useContext(usercontext);
  const toggleHandler = () => {
    const newData = !state;
    setState(newData);
  };
  
  return (
    <div>
      <div className="container-linkrule1">
        <div className="container-linkrule2">
          <form>
            <p className="p-linkrule">
              ตลอดเว็บไซด์นี้ คำว่า "ผู้ใช้บริการ"
              หมายถึงบุคคลใดๆที่เข้าถึงเว็บไซด์นี้
              การใช้เว็บไซต์นี้ต้องเป็นไปตามข้อตกลงและเงื่อนไขการใช้บริการต่อไปนี้
              ซึ่งผู้ใช้บริการควรอ่านอย่างละเอียด
              การใช้เว็บไซต์หรือเข้าไปดูข้อมูลในหน้าใดๆ
              ถือว่าท่านยอมรับข้อกำหนดและเงื่อนไขการใช้งานที่ระบุไว้ในข้อกำหนดและเงื่อนไขการใช้งานนี้
            </p>
            <h5 className="h3-linkrule">ผู้ใช้บริการ (User)</h5>
            <p className="p-linkrule">
              ผู้ใช้บริการจะต้องกรอกข้อมูลส่วนตัวตามความเป็นจริงเท่านั้น
              หากผู้ให้บริการตรวจสอบว่า ผู้ใช้บริการให้ข้อมูลอันเป็นเท็จ
              ผู้ให้บริการสามารถระงับการให้บริการได้ทันทีโดยไม่ต้อง แจ้งล่วงหน้า
              หากมีการเปลี่ยนแปลงข้อมูลส่วนตัวใดๆ
              ให้ผู้ใช้บริการเข้าไปเปลี่ยนแปลงข้อมูลดังกล่าวจากปุ่ม
              "แก้ไขข้อมูลสมาชิก"
            </p>
            <p className="p-linkrule">
              ผู้ใช้บริการจะต้องรายงานข้อมูลที่เป็นความจริง
              พร้อมทั้งมีข้อมูลประกอบที่เพียบพอ โดยข้อมูลที่ถูกนำเข้า
              จะต้องเป็นของผู้ใช้บริการ หรือ
              ได้รับความยินยอมจากบุคคลที่เกี่ยวข้องแล้วเท่านั้น ทาง
              Blacklistseller.com
              จะไม่รับผิดชอบต่อสิ่งที่ผู้ใช้บริการละเมิดและสร้างความเสียหายใดๆ
              กับผู้อื่นในทุกกรณี โดยจะถือว่าข้อมูลที่ผู้ใช้บริการนำเข้ามาใน
              Blacklistseller.com
              เป็นความรับผิดชอบของผู้ใช้บริการนั้นๆแต่เพียงผู้เดียว
            </p>
            <p className="p-linkrule">
              ห้ามผู้ใช้บริการนำเข้าข้อมูลในเชิงข่มขู่ ใช้ภาษารุนแรง หยาบคาย
              ไม่สุภาพ หรือนำเข้าเรื่องส่วนตัวของบุคคลที่สาม
              โดยไม่มีข้อยกเว้นทั้งสิ้น
            </p>
            <p className="p-linkrule">
              ห้ามใช้ MonkeyFraud.com เพื่อผลประโยชน์ทางธุรกิจในทุกรูปแบบ
              ทั้งการแอบอ้าง หรือขายบริการต่อ หากท่านทำความเสียหาย ให้กับผู้อื่น
              ทาง Blacklistseller.com จะไม่รับผิดชอบต่อข้อเสียหายในทุกกรณี
              ทั้งนี้ผู้ให้บริการเปิดให้บริการสำหรับการใช้เพื่อส่วนตัวเท่านั้น
            </p>

            <h5 className="h3-linkrule">ผู้ให้บริการ (Service Provider)</h5>
            <p className="p-linkrule">
              MonkeyFraud.com ให้บริการ การสร้างรายงานโดยผู้ใช้งาน
              อีกทั้งบริการค้นหาข้อมูล แก่ผู้ใช้บริการทุกท่าน
              โดยไม่คิดค่าบริการใดๆ
            </p>
            <p className="p-linkrule">
              ผู้ให้บริการขอสงวนสิทธิ์อย่างเด็ดขาดในการเปลี่ยนแปลงหรือแก้ไขข้อตกลงและเงื่อนไขใดๆ
              ในการใช้บริการเว็บไซต์นี้ ไม่ว่าทั้งหมดหรือบางส่วน
              โดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
              และการที่ผู้ใช้บริการยังคงใช้บริการเว็บไซต์นี้ย่อมถือว่าท่านยอมผูกพันตามข้อตกลงและเงื่อนไขที่มีการเปลี่ยนแปลงหรือบังคับใช้แล้วทุกประการ
              หากพบว่าผู้ใช้บริการ ละเมิดข้อตกลงที่ได้กำหนดไว้
              Blacklistseller.com ขอสงวนสิทธิ์ในการระงับการให้บริการ
              โดยมิต้องแจ้งให้ทราบล่วงหน้า
            </p>
            <p className="p-linkrule">
              หากพบว่าผู้ใช้บริการ ละเมิดข้อห้ามตามข้อตกลง หรือผิดต่อ
              พ.ร.บ.ว่าด้วยการกระทำผิด เกี่ยวกับระบบคอมพิวเตอร์ หรือ
              นำไปใช้ในทางที่ผิดต่อกฎหมายในราชอาณาจักรไทย
              ผู้ให้บริการที่ขอสงวนสิทธ์งดให้บริการแก่ผู้ใช้บริการผู้นั้นต่อไป
              รวมทั้งลบรายงานของผู้ใช้บริการท่านนั้น ทันที
            </p>

            <h5 className="h3-linkrule">
              การปฏิเสธความรับผิดและข้อจำกัดความรับผิด (Disclaimer Policy)
            </h5>
            <p className="p-linkrule">
              ผู้ให้บริการไม่รับรองหรือรับประกัน
              และขอปฏิเสธความรับผิดชอบต่อข้อมูลใดๆที่ผู้ใช้บริการนำเข้ามา
              ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย ทั้งความถูกต้อง ความเหมาะสม
              ความน่าเชื่อถือ การมีอยู่และใช้งานได้
              ของข้อมูลและ/หรือเนื้อหาตลอดจนส่วนประกอบต่างๆ
              ที่มีอยู่ในเว็บไซต์นี้ โดยข้อมูลที่ปรากฏในเว็บไซด์แห่งนี้
              จะตกความรับผิดชอบของผู้ใช้บริการผู้นำเสนอข้อมูลนั้นๆ
              แต่เพียงผู้เดียว โดยข้อมูลในเว็บไซด์นี้เป็นข้อมูลที่มีให้
              "ตามสภาพเท่าที่เป็น" และ "เท่าที่อยู่"
              ซึ่งกระทำผ่านเครื่องคอมพิวเตอร์อัตโนมัติทั้งหมดเท่านั้น
              ทางเว็บไซด์ไม่รับประกัน
              หรือรับรองว่าข้อมูลที่ถูกนำเข้ามาจะสมบูรณ์และถูกต้อง
              และเชื่อถือได้เป็นปัจจุบัน อย่างไรก็ตาม
              หากผู้ใช้บริการพบข้อมูลที่ไม่เหมาะสม หรือไม่เป็นความจริง
              ผู้ใช้บริการสามารถร้องเรียนรายงานที่ไม่เหมาะสมได้
            </p>
            <p className="p-linkrule">
              ผู้ให้บริการจะไม่รับผิดชอบต่อความสูญเสียหรือความเสียหายใดๆ
              ที่เกิดขึ้น ไม่ว่าโดยตรงหรือโดยอ้อม
              (รวมถึงความเสียหายอันเป็นผลสืบเนื่อง ความเสียหายเกี่ยวเนื่อง
              และความเสียหายซึ่งไม่ใช่ผลอันอาจคาดหมายได้โดยตรง)
              จากข้อมูลและการใช้บริการเว็บไซต์นี้
            </p>
            <p className="p-linkrule">
              ทาง MonkeyFraud.com ขอสงวนสิทธิ์ในการลบรายงานที่ไม่เหมาะสม หรือ
              ไม่มีมูลความจริงเท่าที่ควร หรือเป็นข้อมูลทุจริต
              โดยมิต้องแจ้งให้ทราบล่วงหน้า
            </p>

            <h5 className="h3-linkrule">ข้อร้องเรียน (Complaint)</h5>
            <p className="p-linkrule">
              หากผู้ใช้บริการมีคำถามหรือต้องการร้องเรียน
              โปรดติดต่อผู้ดูแลเว็บไซต์ ที่ admin@MonkeyFraud.com หรือ
              www.facebook.com/MonkeyFraudSupport
            </p>

            <Form.Group controlId="formBasicCheckbox">
              <Form.Check
                className="linkrule1"
                type="checkbox"
                onClick={toggleHandler}
                label="โปรดกดปุ่มยืนยันนี้ ก่อนกดยอมรับข้อตกลง"
              />
            </Form.Group>
            {state ? (
              <a href="/post/create" className="buttonrule" type="button">
                ยอมรับข้อตกลง
              </a>
            ) : (
              <a className="buttonrule1" type="button">
                ยอมรับข้อตกลง
              </a>
            )}
          </form>
        </div>
      </div>
    </div>
  );
};

export default Rule;